    [
        {
            "id" : 1,
            "type" : "Undergraduate/Full time",
            "url" : "https://github.com/hen254/MyCareer/blob/gh-pages/positions.json/1",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Kenyatta University",
            "company_url" : "https://www.ku.ac.ke",
            "location" : "Nairobi",
            "title" : "Accounting and Finance",
            "description" : "<p><b>As well as providing a route into financial professions, a degree in accountancy and finance develops skills that are useful in a range of sectors</b><p>\n<p><h5>Job options</h5></p>\n<p>Jobs directly related to your degree include:</p>\n<p><ul><li>Chartered accountant</li><li>Chartered certified accountant</li><li>Chartered management accountant</li><li>Chartered public finance accountant</li><li>Company secretary</li><li>External auditor</li><li>Forensic accountant</li><li>Stockbroker</li></ul></p>\n<p>Jobs where your degree would be useful include:</p>\n<p><ul><li>Actuary</li><li>Arbitrator</li><li>Business development manager</li><li>Data analyst</li><li>  Economist</li><li>Licensed conveyancer</li><li>Management consultant</li><li>Mortgage adviser</li><li>Procurement manager</li><li>Retail banker</li><li>Tax adviser</li></ul></p>\n<p>Remember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Work experience</b></p>Gaining some type of work experience is an important part of getting professional qualifications. An internship or work shadowing opportunity will show potential employers that you have the skills and practical experience they're looking for.</p>\n<p>If your course didn't include a work placement, look for a role in a field that interests you. This could include part-time work in a local accountancy firm or work experience in the finance department of any organisation. Experience that shows you have office and admin skills, as well as the ability to work with numbers and budgets, will be helpful.</p>\n<p>Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nOpportunities are widely available with:</p>\n<p>accountancy,firms,building societies,high street banks,insurance companies,investment banks,management consultancies and public sector employers. The main graduate recruiters are the very large multinational accountancy firms. They use large-scale recruitment campaigns to attract the most promising graduates and have high minimum requirements. There are also opportunities in small to medium-sized enterprises (SMEs) that specialise in a particular type of work or local area.In the UK, a cluster of public sector jobs are available in central London with others available nationwide.Find information on employers in accountancy, banking and finance, business, consulting and management, and other job sectors</p>\n<p><b>Skills for your CV</b>\nAccountancy and finance degrees provide you with knowledge of accountancy practices, commerce, industry and finance. As well as developing a range of subject-specific and technical skills, you also gain more general skills including:</p>\n<p><ul><li>knowledge and awareness of business organisations</li><li>numerical and quantitative skills</li><li>problem-solving and analytical ability</li><li>oral and written communication skills</li><li>ability to argue your case and negotiate</li><li>knowledge of global business issues and language skills, particularly if you study European or international finance</li><li>entrepreneurship..</li></ul></p>\n<p><b>Further study</b>\nAccountancy and finance graduates often go into posts that require further professional accountancy qualifications, such as the: Association of Chartered Certified Accountants (ACCA) qualification, Chartered Institute of Management Accountants (CIMA) professional qualification, Association of Accounting Technicians (AAT) qualification.\nAs an accountancy graduate, you may have exemption from some of these examinations, depending on the modules and credits you've achieved in your degree. Some postgraduate courses train you to work in a more specialised area of the financial industry, such as an MSc in actuarial science. It's also possible to study for a PhD in specific areas of finance, such as banking or trade statistics. For more information on further study and to find a course that interests you, see Masters degrees and search for postgraduate courses in accountancy and finance.</p>\n<p><strong>What do accountancy and finance graduates do?</strong>\nAlmost a third of graduates (31%) work as chartered and certified accountants. The second most common occupation is finance and investment analysts and advisers (10%). Eight of the top ten jobs held by graduates are related to their degree subject.</p>\n<p><strong>Find out more from:</strong>\n<ul><li>Association of International Accountants (AIA)</li><li>Chartered Institute of Public Finance & Accountancy (CIPFA)</li><li>Institute of Chartered Accountants in England and Wales (ICAEW)</li><li>Institute of Chartered Accountants of Scotland (ICAS)</li><ul></p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.ku.ac.ke\">Kenyatta University</a></p>\n<p><strong>",
            "company_logo" : "https://image.pngaaa.com/572/2147572-middle.png"
        },
        {
            "id" : 2,
            "type" : "Undergraduate|Full time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Kenya Aeronautical College",
            "company_url" : "https://kac.co.ke",
            "location" : "Wilson airport",
            "title" : "Aerospace engineering",
            "description" : "<p><b>Whether you enjoy solving technical challenges or being creative and innovative, aerospace engineering opens up opportunities in a range of industries, from automotive to finance and IT</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Aerospace engineer</li><li>CAD technician</li><li>Design engineer</li><li>Higher education lecturer</li><li>Maintenance engineer</li><li>Manufacturing systems engineer</li><li>Materials engineer</li><li>Mechanical engineer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Automotive engineer</li><li>Patent attorney</li><li>Control and instrumentation engineer</li><li>Product designer</li><li>Production manager</li><li> Quality manager </li><li>Sales executive</li><li>Technical sales engineer</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nKCSE Mean Grade – B or Equivalent for the Degree Course KCSE Mathematics – B- (B Minus) or Equivalent for the Degree Course KCSE Physics – B- (B Minus) or Equivalent for the Degree Course KCSE Chemistry – B- (B Minus) or Equivalent for the Degree Course KCSE English – C+ or Equivalent for the Degree Course</p>\n<p><b>Work Experience</b>\nEmployers value experience gained through industrial placements, summer placements or part-time work. Industrial placements as part of your course will add valuable experience to your CV and may also lead to job openings as employers often see placements as an opportunity to identify future recruits. If industrial placements are not part of your course, look for summer placements with major engineering or manufacturing companies. Work experience in any kind of role within manufacturing, maintenance or related settings, whether in the office, factory shop floor or laboratory, will help you understand the whole production process and develop skills such as designing, research or working in a team. You could also join relevant societies while at university to show your interest. Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nEmployers value experience gained through industrial placements, summer placements or part-time work.Industrial placements as part of your course will add valuable experience to your CV and may also lead to job openings as employers often see placements as an opportunity to identify future recruits. If industrial placements are not part of your course, look for summer placements with major engineering or manufacturing companies. Work experience in any kind of role within manufacturing, maintenance or related settings, whether in the office, factory shop floor or laboratory, will help you understand the whole production process and develop skills such as designing, research or working in a team. You could also join relevant societies while at university to show your interest. Search for placements and find out more about work experience and internships.</p>\n<p><b>Skills for your CV</b>\nAerospace engineering students develop specialist knowledge in areas such as mechanics, aerodynamics, stress engineering, materials and structures, and sustainable aircraft design,Employers are also interested in the broader technical, interpersonal and IT skills you acquire studying aerospace engineering, such as the ability to:\n<ul><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li></ul></p>\n<p><b>Further study</b>\nYou can complete an MEng, which involves an integrated additional year of study, or undertake a separate Masters qualification after BEng level in a specialist subject field. Research through an MRes, MPhil or PhD is also possible. As a new graduate employee, you may work towards Incorporated or Chartered status through the Engineering Council to achieve professional standards and you can be involved in further work-related education and training. For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in aerospace engineering.</p>\n<p><b>What do aerospace engineering graduates do?</b>\nThe most popular occupation is mechanical engineer (18%). Other common occupations for aerospace engineering graduates include design and development engineers, other engineering professionals, and programmers and software development professionals.</p>\nFind out what other aerospace engineering graduates are doing 15 months after finishing their degrees in What do graduates do?",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"http://kac.co.ke\">Kenya Aeronautical College</a></p>\n",
            "company_logo" : "https://www.kac.co.ke/img/imgfav.png"
        },
        {
            "id" : 3,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Nairobi",
            "company_url" : "https://cavs.uonbi.ac.ke/",
            "location" : "Nairobi",
            "title" : "Agriculture",
            "description" : "<p><b>A degree in agriculture gives you the knowledge and skills needed to manage agricultural and farm businesses, or to work in areas such as agricultural sales, food production and farming journalism</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Agricultural consultant</li><li>Estates manager</li><li>Farm manager</li><li>Fish farm manager</li><li>Plant breeder/geneticist</li><li>Rural practice surveyor</li><li>Soil scientist</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Amenity horticulturist</li><li>Commercial horticulturist</li><li>Field trials officer</li><li>Forest/woodland manager</li><li>Magazine journalist</li><li>Sales executive</li><li>Newspaper journalist</li><li>Horticultural consultant</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nHolders of Kenya Certificate of Secondary Education (KCSE) with mean grade of C+ or equivalent with passes at C plain or above in Biology or Biological Sciences and any one of the following subjects: Chemistry, Physics, Physical Sciences, Mathematics, Agriculture  or Geography.</p>\n<p><b>Work Experience</b>\nIt's important to get hands-on work experience, which will increase your chances of securing a job after graduation. If you don't have the opportunity to complete a placement year as part of your course, look for relevant work in the holidays. This may involve going to local commercial farms and asking if they have any extra work or seeing if you could shadow someone who works in farm management.Search for local voluntary projects in your area involving agricultural or environmental work.</p>\n<p><b>Typical employers</b>\nThere are diverse opportunities available for agriculture graduates. For example, you can work in areas such as farm management, the service and supply industries, sales, research, or advisory and consultancy work. Opportunities are available in both the public and private sectors in Kenya and abroad.\nTypical employers include:\n<ul><li>agricultural and agri-pharmaceutical consultancies</li><li>agricultural machinery firms</li><li>environmental consultancies</li><li>farm management and commercial ancillary companies</li><li>food processing companies</li></ul></p>\n<p><b>Skills for your CV</b>\nStudying agriculture helps you develop a mix of technical skills and knowledge, including land use, farming practice, food production, crop and livestock science, use of farm machinery, sustainability and environmental management.You also gain an understanding of the scientific, technical, ethical and business principles that underpin the agricultural industry.Employers are interested in the broader skills you acquire, such as:\n<ul><li>the ability to communicate well, including influencing and leadership</li><li>numeracy and IT - helpful for understanding and improving economics in an agricultural role</li><li>initiative - having the confidence to take initiative and make decisions is important in farming</li><li>organisational skills</li><li>the ability to plan and conduct research</li><li>project management skills.</li><li>Team work.</li></ul></p>\n<p><b>Further study</b>\nIt's possible to study for a Masters or other postgraduate qualification in a related area such as crop science and management, animal technology and agricultural technology. If you want to move into research or lecturing, you'll usually need a PhD. Undertaking postgraduate study may also be useful if you want to move into a different career such as journalism, marketing or business consulting. For more information on further study and to find a course that interests you, see Masters degrees and search for postgraduate courses in agriculture.</p>\n<p><b>What do Agriculture graduates do?</b>\nOne in ten (11%) agriculture graduates are working as chartered surveyors, while a further 10% are managers and proprietors in agriculture and horticulture. Others become farm workers (6%), agricultural scientists (6%) and business sales executives (4%).</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://cavs.uonbi.ac.ke/\">University of Nairobi</a></p>\n",
            "company_logo" : "https://i0.wp.com/www.school-directory.org/wp-content/uploads/2018/03/UoN-logo.png?ssl=1"
        },
        {
            "id" : 4,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "United States Internation University-Africa",
            "company_url" : "https://usiu.ac.ke",
            "location" : "Nairobi",
            "title" : "Animations engineer",
            "description" : "<p><b>An animation degree develops creative and technical skills suitable for film and many other creative and digital careers</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Animator</li><li>Concept artist</li><li>Games developer</li><li>Graphic designer</li><li>Illustrator</li><li>VFX artist</li><li>Web designer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Advertising art director</li><li>Artworker</li><li>Exhibition designer</li><li>Film director</li><li>Film/video editor</li><li>Game artist</li><li>Multimedia specialist</li><li>Music producer</li><li>Sound engineer</li><li>Special effects technician</li><li>Television production coordinator</li><li>Television/film/video producer</li><li>Production designer, theatre/television/film</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nAdmission to undergraduate degree programs are based on academic achievement at the secondary level. All applicants are expected to satisfy procedures and criteria for admission to USIU-Africa, and to submit acceptable original documents which verify that they have satisfactorily completed, and met all admission requirements with a minimum of C plus grade in KCSE. For internationa applications, check the website.Applicants for admissions into the undergraduate degree programs are subject to selective screening based on academic achievement at the secondary level.</p>\n<p><b>Work Experience</b>\nAnimation is a competitive area but work experience can help to develop your technical skills, build your network, and give you access to further opportunities. Any experience you can gain in the animation industry is extremely useful, as is broader film or TV experience, working in roles such as a runner.You could also look for opportunities which allow you to develop complementary skills, such as working with others, working independently and managing your own time.Consider opportunities within student media, promotion or fundraising. Or offer to create promotional shorts or animations for the website of a charity or not-for-profit organisation.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nYour skills as an animator are also in demand in other areas, such as computer systems design, software publishing, advertising, marketing, data visualisation (for example for models of election results), insurance (for the simulation and investigation of accident scenes), and medical, architectural or crime scene animation. Find information on employers in creative arts and design and media and internet, and other job sectors.</p>\n<p><b>Skills for your CV</b>\ntudying an animation degree gives you the opportunity to acquire expertise in a range of technical skills, including drawing and model-making. It's usually possible to choose modules relating to the type of animation you wish to work in or you may opt to study a more general combination.You'll also learn to work well individually and collaboratively with others, developing useful transferable skills, such as:\n<ul><li>managing your own time and projects</li><li>attention to detail</li><li>creativity</li><li>communication</li><li>problem solving</li><li>interpersonal and teamworking skills.</li></ul></p>\n<p><b>Further study</b>\nIf you have an undergraduate degree in animation, it's not usually necessary to embark on further study in this area. However, some students choose to, usually in the form of an MFA degree, in order to deepen their expertise in animation. Further study may also help you to develop and define your own style.ScreenSkills has details of training courses suitable for both new entrants and professionals. Some funding may be available through the animation skills fund or in the form of a bursary. Find out more at ScreenSkills - Education and training.For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in animation.</p>\n<p><b>What do Animations engineer graduates do?</b>\nA quarter (25%) of animation graduates become graphic designers, while 16% become artists (both commercial and non-commercial). Sales and retail assistant roles are the third most popular occupation. A small number of graduates become arts officers, producers and directors.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://usiu.ac.\">Usiu</a></p>\n",
            "company_logo" : "https://upload.wikimedia.org/wikipedia/commons/9/96/USIU_Africa_Logo.png"
        },
        {
            "id" : 5,
            "type" : "Undergraduate|Variant",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Nairobi",
            "company_url" : "http://www.ounbi.ac.ke",
            "location" : "Both Physical and Remote",
            "title" : "Anthropology",
            "description" : "<p><b>A degree in anthropology covers the cultural and biological diversity of humans. The broad discipline you will gain from studying both science and the humanities could lead to a variety of careers</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Charity officer</li><li>Community development worker</li><li>International aid/development worker</li><li>Local government officer</li><li>Market researcher</li><li>Social researcher</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Chaplain</li><li>Equality, diversity and inclusion officer</li><li>Higher education lecturer</li><li>Human resources officer</li><li>Museum/gallery curator</li><li>Policy officer</li><li>Political risk analyst</li><li>Public relations officer</li><li>Social worker</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nThose that have a minimum aggregate of C+ (plus) in KCSE or those with the equivalent of a KCSE from an Institution recognized by the University of Nairobi Senate. 2. Those who have a minimum aggregate of C (plain) in KCSE plus a Diploma from an Institution recognized by the University of Nairobi Senate.</p>\n<p><b>Work Experience</b>\nGaining work experience is vital when starting out in most careers and shows commitment to a future employer. Take a proactive approach and find opportunities in which you can build up a desirable range of skills such as communication, planning, and project management.Look for opportunities that are relevant to the area in which you wish to work. For example, if you want to get into charity or international aid roles, there are many opportunities for you to volunteer overseas in your summer break. Involvement in a student society can help you develop relevant skills and experience in, for example, publicity, campaigning, and public speaking.Try contacting local council offices or museums and galleries for information about project activities and ask if they need volunteers to help out with the organisation or running of events.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nA high proportion of anthropology graduates work in the public and not-for-profit sectors, all branches of the Civil Service, local government, charities, central government bodies, universities, international organisations, such as the United Nations (UN), museums and voluntary organisations.</p>\n<p><b>Skills for your CV</b>\nAs well as knowledge of anthropology, your degree equips you with general skills, including:\n<ul><li>written communication</li><li>analytical and critical skills</li><li>time management and problem-solving</li><li>oral communication and presentation skills</li><li>discussion and group work skills</li><li>the ability to gather, assess and interpret data</li><li>organising and planning</li><li>clear, logical and independent thinking</li><li>statistical and computing techniques</li><li>the ability to construct an argument.</li></ul></p>\n<p><b>Further study</b>\nSome students go on to Masters degrees and specialise in an anthropological area, such as visual or medical anthropology, while others pursue related disciplines, such as community health, sociology, social research methods, politics, human geography and economics.Anthropology graduates also take up vocational courses, such as museum ethnography, counselling, health and social work.To find a course that interests you, search postgraduate courses in anthropology.</p>\n<p><b>What do Anthropology graduates do?</b>\nSome students go on to Masters degrees and specialise in an anthropological area, such as visual or medical anthropology, while others pursue related disciplines, such as community health, sociology, social research methods, politics, human geography and economics.Anthropology graduates also take up vocational courses, such as museum ethnography, counselling, health and social work.To find a course that interests you, search postgraduate courses in anthropology.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://uonbi.ac.ke\">University of Nairobi</a></p>\n",
            "company_logo" : "https://i0.wp.com/www.school-directory.org/wp-content/uploads/2018/03/UoN-logo.png?ssl=1"
        },
        {
            "id" : 6,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Rongo University",
            "company_url" : "https://www.rongoversity.ac.ke",
            "location" : "Rongo Town",
            "title" : "Archaeology",
            "description" : "<p><b>An archaeology degree can lead you directly into a variety of jobs within the heritage sector and you'll also be valued by local government employers</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Academic researcher</li><li>Archaeologist</li><li>Conservator</li><li>Heritage manager</li><li>Historic buildings inspector/conservation officer</li><li>Museum education officer</li><li>Museum/gallery curator</li><li>Museum/gallery exhibitions officer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Archivist</li><li>Cartographer</li><li>Higher education lecturer</li><li>Records manager</li><li>Social researcher</li><li>Tourism officer</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nA minimum aggregate grade of C plus in KCSE or a relevant diploma from a recognized university.</p>\n<p><b>Work Experience</b>\nSome employers of archaeologists will expect you to have experience in related areas so look for suitable opportunities. By doing this you'll also show your commitment and genuine interest in the career.Consider volunteering as a digger or check out opportunities with local museums and galleries and heritage organisations.Volunteer work will introduce you to the demands of working outdoors, in all weather conditions. It's an excellent way of demonstrating your physical fitness and resilience, as well as making sure the work is something you'll enjoy as a career. Volunteering is also great for networking and making useful contacts.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nEmployers of archaeologists include: archaeological contractors,independent archaeological consultants, local government,national heritage agencies,private museums and charities,university archaeology departments.In addition, you can look for opportunities in the area of rescue archaeology. This can also be known as commercial, contract, compliance, preventive or salvage archaeology, and it takes place before any building work or land development.</p>\n<p><b>Skills for your CV</b>\nDuring your degree, you'll develop a mix of subject-specific and technical skills:\n<ul><li>applying theoretical and scientific principles and concepts to archaeological problems</li><li>field work, post-excavation and laboratory techniques</li><li>applying statistical and numerical techniques to process archaeological data</li><li>interpretation of spatial data.</li><li>form structured arguments supported by evidence</li><li>use various IT packages</li><li>prepare and give oral presentations for different audiences</li><li>retrieve information to produce written reports</li><li>work methodically and accurately</li><li>work as a team member or leader through field and project work</li></ul></p>\n<p><b>Further study</b>\nYou can explore a range of specialist areas, such as human osteology and palaeopathology, as well as related subjects, like geophysics. A PhD is often necessary if you want to pursue a career in archaeological research or academia.</p>\n<p><b>What do Archaeology graduates do?</b>\nSocial and humanities scientist is the most popular role for archaeology graduates working in the UK, with 14% engaged in this type of work.</p>",
            "how_to_apply" : "<p>Please, visit the university website at <a href=\"https:rongoversity.ac.ke\">Rongo University</a></p>\n",
            "company_logo" : "https://s3.amazonaws.com/kampuni/organisation/images/thumbnail/CkT9iGviAA6rkvK4egK0f8xNmn0BUUFwJOoK2C0D.jpg"
        },
        {
            "id" : 7,
            "type" : "Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Technical University of Mombasa",
            "company_url" : "https://www.tum.ac.ke",
            "location" : "Mombasa",
            "title" : "Architecture",
            "description" : "<p><b>An architecture degree gives you visual, planning and technical skills meaning you'll be set up for a creative, design-based career</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Architect</li><li>Town planner</li><li>CAD technician</li><li>Interior and spatial designer</li><li>Fire risk assessor</li><li>Building control surveyor</li><li>Architectural technologist</li><li>Urban designer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Building surveyor and Estimator</li><li>Commercial/residential surveyor</li><li>Construction manager</li><li>Estates manager/Structural engineer</li><li>Historic buildings inspector/conservation officer</li><li>Landscape architect</li><li>Planning and development surveyor</li><li>Production designer, theatre/television/film</li><li></li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nThe basic admissions requirement shall be the minimum entry requirements set for entry into the public universities, which is at least an average grade of C+ in the Kenya Certificate of Secondary Education (KCSE).In addition, candidates are expected to have performed well in the following cluster of subjects in KCSE examinations, but at any rate shall have obtained at least a grade of C+ in each of the cluster subjects like Physics,Chemistry,Biology/any Group III/any Group IV/any Group V.</p>\n<p><b>Work Experience</b>\nFinding work experience or an industrial placement will be beneficial. These types of opportunities help you to develop an understanding of architectural practices and the industry from the inside. You'll make important contacts and build your confidence, as well as your skill set. Completing work experience also demonstrates to potential employers that you're hardworking, reliable and motivated.If you intend on qualifying as an architect, approach practices directly in search of work experience. Try architectural, design or construction firms. Many offer internships over the summer.Related areas such as landscape design, the built environment and other design practices also provide good opportunities to build your experience. Practice your drawing and model-making skills and keep up to date with current trends in the industry.Find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nArchitects work in a range of establishments. Graduates may be employed by small firms with fewer than ten employees or larger practices that incorporate other areas such as planning, urban design or construction.Public sector employers, such as local authorities and housing associations, employ a significant proportion of the profession in their planning departments, while some large organisations, such as banks and supermarkets, may have in-house architectural teams.Find information on employers in property and construction, engineering and manufacturing, and other job sectors.</p>\n<p><b>Skills for your CV</b>\nWhile studying architecture, you'll develop specific skills plus a range of transferable core skills that include:\n<ul><li>numeracy, design and drawing</li><li>T skills, e.g. computer-aided design (CAD) and project management skills</li><li>the ability to solve problems in an analytical, logical way</li><li>the ability to work as part of a team and research skills</li><li>written and oral communication in various settings</li><li>adaptability and flexibility for dealing with unexpected situations where necessary</li><li>Decision making ability</li><li>he ability to reflect on, and improve, your professional performance.</li></ul></p>\n<p><b>Further study</b>\nMost architecture graduates eventually go on to complete the final stages of the qualifications recognised by RIBA and the Architects Registration Board (ARB) in order to progress towards qualifying and practising as registered architects.Apart from further qualifications in architecture, you could choose postgraduate study in other technical subjects, such as engineering, design or computer science, or in subjects outside the technical and construction fields.</p>\n<p><b>What do Architecture graduates do?</b>\nMore than half of architecture graduates (54%) are working as architectural and town planning technicians six months after graduation, with a further 7% working as chartered architectural technologists, and 4% as architects. </p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://tum.ac.ke\">Technical University of Kenya</a></p>\n",
            "company_logo" : "https://upload.wikimedia.org/wikipedia/en/a/a5/Technical_University_of_Mombasa.logo.png"
        },
        {
            "id" : 8,
            "type" : "Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Jomo Kenyatta University of Agriculture and Technology",
            "company_url" : "https://www.jkuat.ac.ke",
            "location" : "Nairobi",
            "title" : "Biochemistry",
            "description" : "<p><b>A biochemistry degree opens up a range of careers in industry and research in areas such as health, agriculture and the environment</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Academic researcher</li><li>Research scientist (life sciences)</li><li>Scientific laboratory technician</li><li>Physician associate</li><li>Pharmacologist</li><li>Nanotechnologist</li><li>Medicinal chemist</li><li>Forensic scientist</li><li>Clinical scientist, biochemistry</li><li>Clinical research associate</li><li>Biotechnologist</li><li>Analytical chemist</li><li>Biomedical scientist</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Toxicologist</li><li>Science writer</li><li>Patent examiner</li><li>Neuroscientist</li><li>Medical science liaison</li><li>Health and safety inspector</li><li>Environmental engineer</li><li>Chartered accountant</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\n must have passed Biology or Biological Sciences and chemistry in KCSE at a minimum grade of C+. In addition a student must have passed either maths or physics / Physical Science. 1.5 have any other qualifications accepted by the University Senate as equivalent to 1.1 to 1.4. among other requirements</p>\n<p><b>Work Experience</b>\nThe practical and technical skills you develop during your biochemistry degree - through laboratory-based work and your final year research project - prepare you well for a research or technical position. Obtaining some work experience, for example a summer internship in a research laboratory or company, will help to boost your chances of finding a job.Some universities provide a four-year undergraduate course that includes an industry/research placement year. This is usually undertaken in the pharmaceutical or biotechnical industries or a research institute. Opportunities also exist to take a placement abroad, expanding your career prospects. Work placements help develop key skills further and provide opportunities for building contacts and networking.Whatever your career plans, it's important to enhance your degree with extra skills and experiences, which show that you are a proactive person engaging with the world around you.</p>\n<p><b>Typical employers</b>\nOpportunities exist in public health laboratories such as Public Health England and in the laboratories of companies such as Fera.Biochemistry graduates are also employed in industry. Typical employers include pharmaceutical, biotechnology, food, water and agricultural companies. Small companies employ biochemists to provide specialist services, such as toxicological studies.Other employers include scientific and medical publishers and the Intellectual Property Office (as patent examiners). You can also use your biochemistry skills and knowledge in areas such as sales and marketing, where you could be selling the latest technology, and law firms dealing with scientific cases.</p>\n<p><b>Skills for your CV</b>\nDuring your degree you'll develop specific skills associated with biochemistry, such as; in-depth knowledge of molecular biology techniques, practical laboratory skills,the ability to understand complex biological processes,the ability to assemble an argument and engage in debate,observation skills,research and data analysis,critical thinking and problem solving.</p>\n<p><b>Further study</b>\nSome undergraduate courses integrate three years of undergraduate study with a further fourth year of study at postgraduate level, leading to a Masters qualification.Study at Masters or PhD level is usually required for a career in research or industry. A PhD, for example, is essential for academic research or to secure a career as an academic lecturer. Even for associated careers such as publishing, science communication or clinical careers, further qualifications can be an asset and are becoming increasingly important.You'll also need to undertake further study for careers in teaching or law, for example.With a biochemistry degree you can also apply for graduate entry to medicine, dentistry and veterinary science.</p>\n<p><b>What do Biochemistry graduates do?</b>\nA significant number (16%) of biochemistry graduates are working in the UK either as biochemists, medical scientists or laboratory technicians six months after graduation. A large proportion of graduates go on to further study.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.jkuat.ac.ke\">Jkuat</a></p>\n",
            "company_logo" : "https://w7.pngwing.com/pngs/250/194/png-transparent-jomo-kenyatta-university-of-agriculture-and-technology-mombasa-jkuat-karen-campus-technology-thumbnail.png"
        },
        {
            "id" : 9,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Jomo Kenyatta University of Agriculture and Technology",
            "company_url" : "http://www.jkuat.ac.ke",
            "location" : "Nairobi",
            "title" : "Chemical engineering",
            "description" : "<p><b>Chemical engineers work with ground-breaking technologies to enhance the quality of people's lives in areas such as environmental protection, the management of resources, and controlling health and safety</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Biotechnologist</li><li>Chemical engineer</li><li>Energy engineer</li><li>Petroleum engineer</li><li>Nuclear engineer</li><li>Colour technologist</li><li>Product/process development scientist</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Analytical chemist</li><li>Energy manager</li><li>Waste management officer</li><li>Quality manager</li><li>Production manager</li><li>Mining engineer</li><li>Materials engineer</li><li>Manufacturing engineer</li><li>Environmental engineer</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nAs noted, chemical engineering jobs require a minimum of a bachelor's degree. Non-engineering requirements include extensive chemistry courses and labs, such as analytical, organic and physical chemistry. Other non-engineering requirements include sequences in calculus and physics. The engineering portion includes coursework and labs in chemical processes, transport, and reactions.</p>\n<p><b>Work Experience</b>\nIndustrial placements are a great way of building up your practical experience and skills, testing and expanding your knowledge, and establishing a network of contacts for future work opportunities. There may also be opportunities to work shadow a chemical engineer to find out more about what they do.Work experience is available in the pharmaceutical, petrochemical, and food and drink industries. Check out the careers section of company websites for more information on the opportunities available.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nYou'll find major employers in gas and oil extraction, oil refining, nuclear and other power generation and process industries, including pharmaceuticals, fine and heavy chemicals, and agrochemicals. Other manufacturing industries that need chemical engineers include those supplying: fibres and polymers, food and drink,plastic and metals, pulp and paper,toiletries.Many chemical development engineers work for engineering consultancy and contracting firms.There are also opportunities to work in pollution control, environmental protection, energy conservation, waste recovery and recycling, alternative energy, medical science and health and safety.Engineers are well equipped for business roles and may also go into careers in financial services, management, consultancy or law.Find information on employers in engineering and manufacturing, energy and utilities, and other job sectors.</p>\n<p><b>Skills for your CV</b>\nn addition to specific technical knowledge, a chemical engineering degree provides a sound theoretical basis for introducing new technology and advancing existing technology. You also gain an awareness of the global and societal context in which engineering solutions are applied.Transferable skills that would be useful in a range of engineering and business-related roles include: problem-solving and analytical skills,project management, through group design work,resource management,teamwork and leadership,IT skills,initiative and attention to detail, through independent research creativity and innovation,communication and presentation skills, developed through group work and presenting research projects.<ul><li> item </li><li> item /li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li><li> item </li></ul></p>\n<p><b>Further study</b>\nOthers go on to take further study at Masters or PhD level in a specialist area of chemical engineering that interested them at undergraduate level. A PhD is essential for a career in academia and research.It's also possible for chemical engineering graduates to take postgraduate study in areas such as design, science or management.For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in chemical engineering.</p>\n<p><b>What do Chemical engineering graduates do?</b>\nTwo-fifths of chemical engineering graduates are working in engineering professions six months after graduation. Of these, 22% are working as production and process engineers.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.jkuat.ac.ke\">Jomo Kenyatta University of Agriculture and Technology</a></p>\n",
            "company_logo" : "https://w7.pngwing.com/pngs/250/194/png-transparent-jomo-kenyatta-university-of-agriculture-and-technology-mombasa-jkuat-karen-campus-technology-thumbnail.png"
        },
        {
            "id" : 10,
            "type" : "Undergraduate/Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Machakos University",
            "company_url" : "https://www.mksu.ac.ke",
            "location" : "Main campus",
            "title" : "Civil engineering",
            "description" : "<p><b>A civil engineering degree prepares you for work in the construction industry as well as in the business, management and financial sectors</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li> Building control surveyor </li><li>Structural engineer</li><li>Site engineer</li><li>Nuclear engineer</li><li>Design engineer</li><li>Contracting civil engineer</li><li>Consulting civil engineer</li><li> item </li><li>Estimator</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>CAD technician</li><li>Water engineer</li><li>Building services engineer/Urban designer</li><li>Sustainability consultant</li><li>Quantity surveyor</li><li>Patent attorney</li><li>Geotechnical engineer</li><li>Fire risk assessor</li><li>Engineering geologist</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements:</b>\n(i) KCSE Mean Grade C+ (Plus) with a minimum of. B+(Plus) or equivalent in Mathematics and Physics. and B(Plain) in Chemistry and English OR (ii) Mean Grade of C (Plain) at KCSE or. equivalent with a Diploma of Credit pass in relevant.</p>\n<p><b>Work Experience</b>\nIt's crucial that you get some relevant work experience during your studies. Employers place great importance on experience, and it'll give you an insight into the working practices of an engineering firm.If your course doesn't include an industrial placement, look for relevant summer internships and placements. Any kind of role in a construction or civil engineering setting will allow you to build your understanding of issues related to the planning and execution of projects. Use this experience to expand your knowledge and to develop contacts and network.Casual, hands-on construction work and administrative jobs may be available, but many employers offer structured work experience opportunities.</p>\n<p><b>Typical employers</b>\nAs a qualified civil engineer you can find work in a range of sectors, particularly in the construction sector, on buildings and large structures of all kinds, transport and communications infrastructure.You can also work for employers involved in the production, storage and distribution of electricity, gas and water.There are also opportunities to work in-house for a variety of national and multinational organisations, particularly within the public sector. Local authorities, government departments and environmental organisations, for example, employ civil engineers to set up project specifications and draft tender documents.Find information on employers in engineering and manufacturing, property and construction, and other job sectors.</p>\n<p><b>Skills for your CV</b>\nWith a solid grasp of science, mathematics and technology, you'll learn to design, create and build structures efficiently, making best use of available resources and techniques.Through realistic construction-based group projects, you'll gain practical experience of applying your engineering judgement and working successfully with others.Transferable skills gained on a civil engineering course include:\n<ul><li>creative approach to problem solvingan.</li><li>critical thinking skills</li><li>analytical and decision-making abilities</li><li>numeracy, IT and communication skills</li><li>ability to interpret data</li><li>awareness of ethical issues</li></ul></p>\n<p><b>Further study</b>\nMost new graduates who enter professional training with a civil engineering company continue to study part time while working in order to achieve either chartered (CEng) or incorporated (IEng) engineer status. The routes to professional registration are outlined by the Engineering Council.Some graduates go on to further study at postgraduate level in order to develop specialist knowledge in a particular area such as water management, earthquake engineering, maritime civil engineering or environmental engineering. Options include a taught Masters, MRes, MPhil or PhD.</p>\n<p><b>What do Civil engineering graduates do?</b>\n84% of civil engineering graduates are in full-time employment 15 months after graduation. Two-thirds are working as civil engineers.</p>",
            "how_to_apply" : "<p>Please, visit the university website athref=\"https://www.mksu.ac.ke\">Machakos University<a></n",
            "company_logo" : "https://i0.wp.com/www.mksu.ac.ke/wp-content/uploads/2019/05/logohead2.png?fit=150%2C167&ssl=1"
        },
        {
            "id" : 11,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Jaramogi Oginga Odinga University of Science and Technology",
            "company_url" : "https://www.jooust.ac.ke",
            "location" : "All campuses",
            "title" : "Computer security & Foreignsics",
            "description" : "<p><b>Computer forensics is a branch of digital forensic science pertaining to legal evidence found in computers and digital storage media.The goal of computer forensics is to examine digital media in a forensically sound manner with the aim of identifying, preserving, recovering, analyzing and presenting facts and opinions about the digital information.Can you really erase all the information from your old smart phone? Before you upgrade to a new device, be careful what you do with the old one. Even if you think you’ve erased it, it could still come back to haunt you.Computer forensics differs from data recovery, which is, recovery of data after an event affecting the physical data, such as a hard drive crash. Computer forensics goes much further. Computer forensics is a complete computer examination with intricate analysis of digital information being the ultimate goal.</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Information Security Analysts</li><li>Computer Systems Analysts</li><li>Malware Analyst</li><li>Information Technology Auditor</li><li>Forensic Computer Analyst</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Telecommunication companies</li><li>Military/Defense</li><li>Data centers</li><li>Organizations dealing with huge critical data</li><li>Aerospace engineering</li><li> System administration </li><li>Network engineering</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nKCSE Mean Grade C+(Plus) with C (Plain) in Mathematics and Physics or Physical Sciences OR 2 Principal pass and 1 subsidiaries at A- Level one of which should be Maths or Physics; KCSE Mean Grade C-(Minus)  with KNEC Diploma in Computer Studies with a minimum credit pass OR Diploma from accredited Institution.</p>\n<p><b>Work Experience</b>\nVolunteering in an organization even before graduation would be a good start to gain experience. You can as well decide to engage inindividual projects and practical sessions or seek for internship opportunities.</p>\n<p><b>Typical employers</b>\nComputer forensics positions can be found at local, state, and federal government agencies, from city police departments to the National Security Agency (NSA), Homeland Security and the FBI (the lead federal agency for investigating cyber attacks by criminals, overseas adversaries and terrorists).* Computer forensics positions, such as a forensic computer analyst, can also be found in the private sector on a full-time or contractual basis at places such as banks, software development companies, law firms, and accounting firms.</p>\n<p><b>Skills for your CV</b>\nComputer forensics is an ever-evolving field. New challenges arise for computer forensics investigators as cybercrimes grow in frequency and complexity, and hardware and software advances. Computer forensics can be a stressful field, as you often need to find information quickly for a criminal investigation and criminals can be highly skilled at technology therefore the folloeing skills are esential:.\n<ul><li>Ethical Issues regarding Data</li><li>Legal Issues regarding Data</li><li>Ability to learn new things</li><li>Analytical Thinking</li><li>Critical Thinking</li><li>Communication Skills</li><li>Problem-solving Skills</li><li>Knowledge of various technology like operating systems, storage divices, malware type and computer programming</li></ul></p>\n<p><b>Further study</b>\nSome decide to do certicifactions. There are many different types of certifications available for computer forensics specialists. Focused either on best practices in a particular concentration or specific software used in the industry, completion of a certification ensures that you have a firm grasp of the ethical and legal issues of the field, industry know-how and current tools. While certification is not a requirement for all positions, job applicants are looked upon more favorably when they have earned their certification.Such includes Certified Forensic Computer Examiner (CFCE),Certified Computer Examiner (CCE) and Global Information Assurance Certification (GIAC) while others become senior forensics investigator or starting their own private practice or consulting agency where they can support a variety of clients.</p>\n<p><b>What do aerospace engineering graduates do?</b>\n</p>",
            "how_to_apply" : "<p>Please, visit the university website at <a href=\"https://www.jooust.ac.ke\">Jaramogi Oginga Odinga University of Science and Technology</a></p>\n",
            "company_logo" : "https://studentsportal.jooust.ac.ke/img/jooust.png"
        },
        {
            "id" : 12,
            "type" : "Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Eldoret",
            "company_url" : "https://www.uoeld.ac.ke",
            "location" : "Eldoret",
            "title" : "Computer science",
            "description" : "<p><b>From games developer to manager of IT and communications services, you'll have a range of opportunities open to you as a computer science graduate</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Application analyst</li><li>Cyber security analyst</li><li>UX designer and Web designer</li><li>Systems analyst</li><li>Software engineer</li><li>Information systems manager</li><li>Games developer</li><li>IT consultant</li><li>Game designer</li><li>Database administrator</li><li>Applications developer</li><li>Data analyst</li><li>Web developer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Forensic computer analyst</li><li>IT sales professional</li><li>Supply chain manager</li><li>Network engineer</li><li>Nanotechnologist</li><li>IT trainer</li><li>Telecommunications researcher</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nTo be eligible for entry into the Bachelor of Computer Science degree program at Eldoret University, a student requires to meet either of the following minimum educational requirements. A minimum mean grade of C+ at KCSE, and at least a C+ in Mathematics, Physics or Physical Sciences, OR 2 Principal passes, one of which must be in Mathematics or Physics at A-Level, OR KNEC Diploma in Computer Studies or its equivalent from a recognized Institution by UoE Senate.</p>\n<p><b>Work Experience</b>\nf your course doesn't offer this, look for IT-related work placements, internships or shadowing opportunities advertised via your careers service or through companies such as Step and Year in Industry.It's useful to develop a personal portfolio of your own projects, such as those involving programming, building a website or carrying out tasks online as a moderator. Evidence of, for example, your initiative and ability in fixing bugs, improving functionality or building an app will help show your skills and interest in the subject.Joining a university club or society that gives you the opportunity to develop your computing, web design or multimedia skills also helps when applying for graduate jobs.</p>\n<p><b>Typical employers</b>\nCommon employers are IT consultancies and IT service providers. However, as most businesses rely on computers to function effectively, there are also opportunities within the IT departments of major organisations in sectors such as: aerospace and defence,agricultural,financial services,healthcare,manufacturing,public and third sectors,retail and telecommunications.You can also find opportunities with a range of small to medium-sized enterprises (SMEs).Another option is to set up your own business, providing IT services such as web design and consultancy.</p>\n<p><b>Skills for your CV</b>\nComputing degrees combine theoretical study and practical projects, teaching you subject-specific skills including:\n<ul><li>programming languages</li><li>hardware architecture and construction</li><li>network design and engineering</li><li>multimedia design</li><li>software engineering</li><li>software tools and packages</li></ul></p>\n<p><b>Further study</b>\nYou may choose to continue your studies at postgraduate level, studying a computer science subject in greater detail through an MSc or PhD. Further study is essential for a career in academia and can be useful for a range of other careers, for example, developing new technologies and products. You can also combine work with further study through Knowledge Transfer Partnerships (KTP).You could also complete a teaching qualification in order to teach IT in secondary schools. Find out more about teacher training options.For information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in computer sciences.</p>\n<p><b>What do Computer science graduates do?</b>\nHalf of computer science graduates in employment in the UK 15 months after graduation are working as programmers and software development professionals, while one in ten (9%) are employed as IT and telecommunications professionals.The top five jobs held by graduates are related to computer sciences and include web design and IT operations technician.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.uoeld.ac.ke\">University of Eldoret</a></p>\n",
            "company_logo" : "https://upload.wikimedia.org/wikipedia/en/0/0a/University_of_Eldoret_Administration_Block.jpeg"
        },
        {
            "id" : 13,
            "type" : "Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Moi University",
            "company_url" : "https://www.mu.ac.ke",
            "location" : "Eldoret West",
            "title" : "Criminology",
            "description" : "<p><b>As a criminology graduate with critical thinking, analytical and communications skills, you're attractive to employers both inside and outside the criminal justice sector</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Civil service administrator</li><li>Crime scene investigator</li><li>Community development worker</li><li>Detective</li><li>Police officer</li><li>Prison officer</li><li>Social worker</li><li>Probation officer</li><li>Youth worker</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Adult guidance worker or Solicitor</li><li>Border Force officer</li><li>Housing manager/officer</li><li>Local government officer</li><li>Political risk analyst</li><li>Social researcher</li><li>Charity officer</li><li>Counsellor</li><li>Paralegal</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nKCSE mean grade C+ IGCSE ‘O’ Level- 5 credit passes IGCSE ‘A’ Level- 2 principals and one subsidiary passes A relevant diploma from an accredited institution.</p>\n<p><b>Work Experience</b>\nEmployers value work experience and there is a range of paid and voluntary opportunities available. These include work with offenders, criminal justice agencies, social work and community education departments, and victims of crime. Specific roles include prison visiting, working as a special constable, and involvement in drug treatment schemes or youth/bail hostels for young offenders.Some courses offer a placement year, which can help you gain insight into particular areas of work and build up contacts for future jobs.Think about the group or the environment you're interested in working with and how you could get involved with local support groups or projects. Narrowing down your preferences will allow you to focus on specific employers and voluntary organisations.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nMajor employers include: central and local government,the police,prison and probation services,the court services,security services,non-profit-making organisations, including the NHS and charities that work with young offenders or victims of crime.Opportunities exist in the private sector, for example in private security and in law practices.It's also possible to work in a range of social welfare posts, such as mental health support and drug rehabilitation, housing (as housing officers or in outreach support roles), as homelessness officers, and in refugee and victim support/counselling.Other areas of work include criminal intelligence, social work, counselling, teaching and research.</p>\n<p><b>Skills for your CV</b>\nStudying criminology develops your understanding of the social and personal aspects of crime, victimisation and responses to crime and deviance, as well as building specific skills such as:\n<ul><li>generating and evaluating evidence</li><li>making reasoned arguments and ethical judgments</li><li>critical thinking and problem-solving</li><li>collecting, analysing and interpreting data</li><li> report writing.</li></ul>\nIf you study other subjects alongside criminology, you should consider the complementary skills they provide you with, for example, an increased awareness of psychology or politics related to criminology topics.Also consider your more general skills in areas such as research, written and oral communication, IT, time management and the ability to work productively both in a group and individually.</p>\n<p><b>Further study</b>\nMost criminology graduates who go on to further study choose from a range of vocational areas including social work, teaching and law conversion courses.Some students choose to progress to Masters courses, including MAs in criminology or criminal justice. These courses enhance your subject knowledge, possibly with a view to going on to further academic research. Courses relevant to specific client groups also exist, such as a Masters in alcohol and drug studies.For more information on further study and to find a course that interests you, see Masters degrees and search for postgraduate courses in criminology.</p>\n<p><b>What do criminology graduates do?</b>\nWelfare and housing associate professional is the most common job for criminology graduates 15 months after graduation. Police officer, legal associate professional, prison service officer and probation officer are also among the top ten jobs reported by criminology graduates.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.mu.ac.ke\">Moi University</a></p>\n",
            "company_logo" : "https://www.logolynx.com/images/logolynx/68/689c3807c4404eb182341f23f3d64547.jpeg"
        },
        {
            "id" : 14,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Jaramogi Odinga Odinga University of Science and Technology",
            "company_url" : "https://www.jooust.ac.ke",
            "location" : "Main campus",
            "title" : "Business Information Systems",
            "description" : "<p><b>Working in the world of information systems can be exciting and rewarding as businesses become more and more reliant on information systems to support innovation, decision making and day-to-day operations.</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Business analyst</li><li>IT security analyst</li><li>Systems architect</li><li>System analyst</li><li>IT project manager</li><li>IT consultant</li><li>Change manager</li><li>Web designer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Business Information Systems and Business Management</li><li>Business Information Systems and Business Analytics</li><li>Business Information Systems and IT/ Cyber Security</li><li>Database Design and Implementation</li><li>Web Design and Development</li><li>Business Computing</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nKCSE Mean Grade C+(Plus) with C- (minus) in Mathematics, English and Business Studies OR 2 Principal pass and 1 subsidiaries at A- Level one should be Maths or Economics; OR KCSE Mean Grade C- ( Minus) with KNEC Diploma in IT related field with a minimum credit pass OR Diploma from accredited institution.</p>\n<p><b>Work Experience</b>\nThe creative use of information systems can transform organisations. Successful enterprises require hybrid managers and analysts who can evaluate and use the tools, gauge the risks and provide the key insights and sound direction for strategic business planning.Our course offers a short-term work-based learning experience that will give you the opportunity to work on a real-life problem, which is normally set by an external organisation as a small-scale project. This experience will allow you to put your new knowledge and skills into practice by addressing a real-life situation, usually within the context of a business-related problem.</p>\n<p><b>Typical employers</b>\nThese include telecommuncation companies,business oranizations, software development incorporations. Also you can opt for starting your own company.</p>\n<p><b>Skills for your CV</b>\nOur Business Information Systems BSc will give you a clear perspective of the current nature and practice of business information systems, and will develop your understanding of the business challenges of an enterprise,and your ability to conceive and manage solutions which are increasingly ICT dependent.You’ll integrate your skills of problem solving and information systems modelling with your knowledge of business processes and environments. You’ll be able to consult on, support or develop the technological platforms of an enterprise to achieve competitive advantage, building a career in roles ranging from systems developer to business manager.</p>\n<p><b>Further You can continue your to your post graduate immediatly after graduation to masters degree or get certification courses to be a conpetitive professional</b>\n text</p>\n<p><b>What do graduates in this field do?</b>\n They enter the field to dispatch their skills as interns,business managers, IT consultants or business owners</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.jooust.ac.ke\">Jaramogi Odinga Odinga University of Science and Technology</a></p>\n",
            "company_logo" : "https://studentsportal.jooust.ac.ke/img/jooust.png"
        },
        {
            "id" : 15,
            "type" : "Undergraduate, Single Honours",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Birmigham",
            "company_url" : "https://www.birmigham.ac.uk",
            "location" : "Remote",
            "title" : "Creative writing",
            "description" : "<p><b>Success as a writer depends on your individual determination and perseverance. However, skills gained on a creative writing course are useful in marketing, PR and teaching, as well as many other careers</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Advertising and copywriter</li><li>exicographer</li><li>Publishing copy-editor/proofreader</li><li>Arts administrator</li><li>Newspaper journalist/Magazine journalist</li><li>Editorial assistant</li><li>Digital copywriter</li><li>Talent agent</li><li>Creative director</li><li>Web content manager</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Academic librarian</li><li>Concept artist</li><li>Web content manager</li><li>Film director</li><li>Social media manager</li><li>Secondary school teacher</li><li>Public relations officer</li><li>Public librarian</li><li>Primary school teacher</li><li>Marketing executive</li><li>Information officer</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nYou will need to demonstrate a certain level of English language, either through an English test such as IELTS, TOEFL or PTE, or we may be able to accept your previous or alternative qualifications as evidence. Please view the entry requirements for specific programme requirements, and details on our presessional English language courses.For study on our Foundation and Undergraduate programmes, English language at grade C or above in the Kenya Certificate of Secondary Education (KCSE) is sufficient to meet the standard English language requirements.For Postgraduate programmes, Kenyan nationals with a degree from Kenya or another English speaking country (as on the University's approved list) are not required to submit an English Language test.</p>\n<p><b>Work Experience</b>\nYou can gain valuable experience by writing for your student newspaper or magazine, volunteering in schools, or getting involved with writers' groups. Also, try submitting work to journals or anthologies, entering competitions, or approaching local drama groups to see if they will use your scripts.To make yourself more employable, look for opportunities to gain some solid work experience. This could be in the form of paid administrative work for a company or volunteering, perhaps with a local charity helping them to promote the work they do.You could also write speculatively to a number of businesses, including publishing houses and marketing firms, to ask if you could complete some short-term work experience or shadowing. This can have the advantage of getting you a foot in the door in a highly-competitive industry and could lead to a permanent position.</p>\n<p><b>Typical employers</b>\nAs a creative writing graduate you may work to establish yourself as a writer on a self-employed basis, either writing your own works, or writing for others in a freelance capacity.Alternatively, you could find opportunities with a variety of employers, including: publishing houses or editorial/technical writing service companies,advertising, marketing and public relations agencies, particularly in a copywriting capacity,primary, secondary, further and higher education institutions,media organisations,general businesses - in an administrative or general management position,national government, library or charitable organisations.</p>\n<p><b>Skills for your CV</b>\nAs well as building specialist knowledge of creative writing, you'll have developed effective written and oral communication skills through your degree. Other strengths you can evidence include:\n<ul><li>creative thinking and problem solving - these skills are useful for many jobs and you'll have gained them from developing characters and storylines</li><li>independent working - having to be self-motivated as a writer means you can effectively determine and direct your own workload</li><li>time management and organisation - learning to structure your time effectively as a writer means you can be highly organised</li><li>planning and researching written work - you'll be adept at this from turning ideas into well-rounded stories</li><li>editorial and proofreading skills - from producing accurately written content</li><li>negotiation skills - learning how to market your work effectively gives you the skill to negotiate in other workplace settings.</li><li>a good understanding of information technology</li><li>presentation skills</li></ul></p>\n<p><b>Further study</b>\nAs a creative writing graduate you can go on to further study in creative writing, or undertake an MA or PhD in a variety of other fields. A common option is to pursue a vocational route such as teaching, journalism, librarianship or publishing.Vocational courses allow you to study in an area in which you would like to have a career, should you choose not to continue as a full-time writer.For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in creative writing.</p>\n<p><b>What do Creative writing graduates do?</b>\nA tenth of creative writing graduates in employment in the UK are working as marketing professionals, while 5% are authors, writers and translators.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.birmigham.ac.uk\">University of Birmigham</a></p>\n",
            "company_logo" : "https://logosrated.net/wp-content/uploads/parser/The-University-of-Birmingham-Logo-1.jpg"
        },
        {
            "id" : 16,
            "type" : "Undegraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Nairobi",
            "company_url" : "https://www.uonbi.ac.ke",
            "location" : "Kenyatta National Hospital",
            "title" : "Dentistry",
            "description" : "<p><b>Dentistry is a vocational degree which gives you the specialist knowledge, technical skills and qualities needed to become a dentist</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Dental hygienist</li><li>Dental therapist</li><li>Dental technician</li><li> item </li><li>Dentist</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Anatomical</li><li>Teaching laboratory technician</li></li><li>Health improvement practitioner</li><li>Secondary school teacher</li><li>Science writer</li><li>Primary school teacher</li><li>Medical sales representative</li><li>Higher education lecturer</li><li>Health service manager</li><li>pathology technologist</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nCandidates for admission must satisfy the general University of Nairobi admission criteria of a mean grade C+ in Kenya Certificate of Secondary Education (K.C.S.E). A minimum C+ Grade pass will be mandatory in each of the cluster subjects.  The cluster subjects for Bachelor of Dental Surgery in K.C.S.E are as follows: Biology. Chemistry. Physics or Mathematics. English or Kiswahili. </p>\n<p><b>Work Experience</b>\nA dentistry degree has a practical element that develops your clinical and technical abilities. Although additional work experience isn't essential to improve your chances of getting a job, a few weeks of work shadowing or experience within a dental practice can show your commitment to the role.Some degrees offer the chance to intercalate. This involves spending a year studying a science or another healthcare subject between your second and third year of studies. It can help to develop your area of interest and focus the direction of your career.Many dental students contribute to charities offering oral healthcare advice to the community. Volunteering will enhance your transferable skills such as communication and team work, as well as building your self-confidence.</p>\n<p><b>Typical employers</b>\nThe vast majority of graduates work as dentists in general dental practice, NHS hospitals and in community dental services.You may also find opportunities in: national and global health charities,private hospitals,teaching and education the armed forces,universities and clinical research organisations.It's also possible to pursue opportunities outside dentistry in industries such as business, finance, marketing, education and sales.Find information on employers in healthcare, charity and voluntary work, teacher training and education, and other job sectors.</p>\n<p><b>Skills for your CV</b>\nA dentistry degree develops your subject-specific skills, technical dental skills, the ability to understand ethical issues and the skills enabling you to treat patients in a caring and empathetic manner. It also equips you with clinical competence alongside manual dexterity.In addition, you'll gain transferable skills, valued both in and outside of dentistry, such as:\n<ul><li>administrative and management skills, to run a dental practice</li><li>analytical and problem-solving skills, to help reach clinical decisions</li><li>the ability to work in and lead a multi-skilled team effectively</li><li>verbal and written communication skills, developed from integrated placements and assignments.</li></ul></p>\n<p><b>Further study</b>\nAfter graduation, you'll undertake a compulsory year of Dental Foundation Training (DFT) within approved general dental practices, which is essential to work within the NHS.If you're fully registered with the General Dental Council (GDC), you can specialise further, for example in orthodontics, periodontics and oral and maxillofacial surgery. These are competitive courses, approved by the GDC, which require experience.Alternatively, you could take a course within a different area if you'd like to follow another career path. For example, a teacher training qualification or a Masters or postgraduate qualification in marketing, business or finance.</p>\n<p><b>What do Dentistry graduates do?</b>\nDentistry is a highly vocational degree and this is reflected in the destinations data. The majority (88%) of dentistry graduates in employment in the UK are working as dental practitioners, with a further 7% employed as medical practitioners or medical and dental practitioners.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.uonbi.ac.ke\">University of Nairobi</a></p>\n",
            "company_logo" : "https://i0.wp.com/www.school-directory.org/wp-content/uploads/2018/03/UoN-logo.png?ssl=1"
        },
        {
            "id" : 17,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Egerton University",
            "company_url" : "https://intc.egerton.ac.ke",
            "location" : "Nakuru",
            "title" : "Economics",
            "description" : "<p><b>Studying social policy and financial markets as part of an economics degree opens up careers in finance, accountancy and government departments</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Actuarial analyst</li><li>Data analyst</li><li>Stockbroker</li><li>Chartered accountant</li><li>External auditor</li><li>Financial risk analyst</li><li>Political risk analyst</li><li>Investment analyst</li><li>Risk manager</li><li>Compliance officer</li><li> item </li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Economist</li><li>Business development manager</li><li>Local government officer</li><li>Management consultant</li><li>Diplomatic service officer</li><li>Civil Service fast streamer</li><li>Data scientist</li><li>Policy officer</li><li>Quantity surveyor</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nApplicants must: Have the Kenya Certificate of Secondary Education with an average grade C+ (C plus) or passed at one sitting from at least seven subjects drawn from subject groupings as specified by the Kenya National Examinations Council or its equivalent.</p>\n<p><b>Work Experience</b>\nLook for work experience within the job sector that you're interested in. For example, if you would like to work as an economist, you may want to consider applying for a place on the Government Economic Service (GES) summer scheme. You will need to be in your penultimate year and have a predicted grade of a 2.1 or first.Individual government departments may also be able to offer work experience and you should contact the department directly to find out more.You could also consider work experience or work shadowing in areas such as accountancy, banking or finance. Contact local employers to see if they can help you.</p>\n<p><b>Typical employers</b>\nEconomists are employed in a variety of settings in both the public and private sectors.The largest employer of economists is the Civil Service through the GES. The Bank of England also provides vacancies through its graduate development programme.Economics graduates also find employment in areas such as: banks (high street and city),charitable and not-for-profit organisations,consultancies,nsurance and accountancy firms,government departments and think tanks.</p>\n<p><b>Skills for your CV</b>\nAn economics degree gives you subject-specific skills enabling you to apply economic principles and models. You'll also gain an understanding of the large driving forces shaping social policy and financial markets, as well as skills in statistical analysis.You'll also develop valuable transferable skills, including:\n<ul><li>communication - presenting findings and explaining complex data</li><li>numeracy - handling complex data and applying mathematical and statistical analysis methods</li><li>problem solving - extracting information, drawing conclusions and making recommendations</li><li>computing - using specialised software</li><li>time management - completing specific tasks within designated time frames</li><li>analytical skills - analysing research methods, data, conclusions and recommendations.</li></ul></p>\n<p><b>Further study</b>\nou may choose to continue studying economics at a higher level, either for personal interest or to help with entry into a particular career. You could choose to specialise within a certain area of economics, such as health, agriculture or regional economic development.Postgraduate study can also be used as a means to change career focus or to gain professional qualifications required to practise in certain career areas, such as accountancy.Although it is not essential, postgraduate study can offer an advantage if you want a career in a competitive area.For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in economics.</p>\n<p><b>What do Economics graduates do?</b>\nThe top five jobs held by economics graduates in employment in the UK are related to business, finance and marketing, with finance and investment analysts and advisers accounting for 17% of jobs. This is also true for nine of the top ten jobs held.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://intc.egerton.ac.ke\">Egerton University</a></p>\n",
            "company_logo" : "https://www.nationmedia.com/wp-content/uploads/2017/02/partner-egerton-university.png"
        },
        {
            "id" : 18,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Jaramogi Oginga Odinga University of Science and Technology",
            "company_url" : "https://www.jooust.ac.ke",
            "location" : "Bondo",
            "title" : "Education",
            "description" : "<p><b>Studying a degree in education directly prepares you for a range of careers working with children and young people</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Community education officer</li><li>Education consultant</li><li>English as a foreign</li> <li>language teacher</li><li>Learning mentor</li><li>Early years teacher</li><li>Education administrator</li><li>Special educational needs coordinator (SENCO)</li><li>Education mental health practitioner</li><li>Special educational needs teacher</li><li>Secondary school teacher/Primary school teacher</li><li>Teaching assistant</li><li>Further education teacher</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Careers adviser</li><li>Child psychotherapist</li><li>Family support worker</li><li>Museum education officer</li><li>Health play specialist</li><li>Play therapist</li><li>Private tutor</li><li>Counsellor</li><li>Youth worker</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nK.C.S.E. Mean Grade of C+(Plus) and a minimum of C(plain) in both English and mathematics OR C-(Minus) plus a relevant KNEC Diploma OR Diploma from accredited University in Early Childhood Development  OR 2 Principal Passes and  1 Subsidiary OR 1 Principal Pass and  2 Subsidiaries.</p>\n<p><b>Work Experience</b>\nVolunteering to help out at a local education, sports, community or youth centre is also a good way to gain some experience of working with children and organising group activities. It may also help you increase your knowledge of educational issues.If you decide to move away from a career in education, think about what areas of work interest you and carry out research into relevant roles and sectors. Use tools such as Job Match to help you decide what type of career you'd be suited to.Look out for work placements and voluntary opportunities advertised via your university career service, on company websites and through the specialist press. Use these opportunities to discover whether you suit the work and to build up a network of contacts. Work shadowing is another useful way of finding out about a particular career.Search for placements and find out more about work experience and internships.</p>\n<p><b>Typical employers</b>\nf you're working in a state-maintained school, your employer will often be your local authority. However, you may be employed directly by the school - if for example, you work for an academy, free school or independent school. You'll also be employed directly by the institution if you work for a college. Other employers include: central government departments,community and voluntary organisations,museums,the police and probation services,social services,universities.There are opportunities with both public and private sector employers in a range of careers such as HR, market and policy research, retail management, publishing, education psychology and careers guidance. Find out more about jobs in education.</p>\n<p><b>Skills for your CV</b>\nStudying education develops specific skills relating to a range of educational topics. These include theories of learning, equality and diversity, education policy and practice, and creativity and education.You'll also gain the following transferable skills, which are useful to employers in a variety of job sectors:\n<ul><li>excellent communication skills - essential for effectively presenting information to learners</li><li>IT skills - needed for researching teaching resources and preparing materials and for communication within the education setting and with external contacts</li><li>organisation and time-management skills - essential for managing a teaching workload and getting planning and marking done on time</li><li>self-management - helping you to work effectively and reflect on your personal practice and make improvements.</li><li>effective problem-solving skills</li><li>interpersonal skills - working collaboratively as part of a team</li><li>research and analytical skills</li></ul></p>\n<p><b>Further study</b>\nAlternatively, you may wish to take a Masters course in education or a related social science in order to develop your understanding of the theory, research and policy of education and to enhance your professional knowledge, skills and practice. Some education graduates go on to study for a PhD in education. Another option is the Masters in TESOL (Teaching English to Speakers of Other Languages).Find out more information about routes into teaching and about options for further study by searching for postgraduate courses in education.</p>\n<p><b>What do education graduates do?</b>\nNearly three quarters (73%) of education graduates in employment in the UK 15 months after graduation are employed in education - including teaching and educational support assistants, primary and nursery education teaching professionals, secondary education teaching professionals and special needs education teaching professionals.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.jooust.ac.ke\">Jaramogi Oginga Odinga University of Science and Technology</a></p>\n",
            "company_logo" : "https://studentsportal.jooust.ac.ke/img/jooust.png"
        },
        {
            "id" : 19,
            "type" : "Diploma|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Mount Kenya University, Thika (MKU)",
            "company_url" : "https://www.mku.ac.ke",
            "location" : "Thika",
            "title" : "Electrical and electronic engineering",
            "description" : "<p><b>From aerospace engineering to telecommunications, a range of career areas are open to you with a degree in electrical and electronic engineering</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Acoustic consultant</li><li>Electronics engineer</li><li>Electrical engineer</li><li>Control and instrumentation engineer</li><li>Broadcast engineer</li><li>Design engineer</li><li>CAD technician</li><li>Aerospace engineer</li><li>Special effects technician</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Sound engineer</li><li>Nuclear engineer</li><li>Clinical technologist</li><li>Technical sales engineer</li><li>Land-based engineer</li><li>Software engineer</li><li>Technical author</li><li>Project manager</li><li>Management consultant</li><li>Machine learning engineer</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nAt least KCSE mean C Plain & ; C Plain in atleast two of the following; Maths, Physics, Geography & Chemistry.</p>\n<p><b>Work Experience</b>\nou can gain a hands-on, practical understanding of engineering systems, and the specialised industries they're used in, through work experience. Some courses offer a year out in industry, providing further opportunities to broaden your skill set and establish a network of contacts. You could also arrange some work experience yourself by checking the careers sections of company websites for opportunities or looking for advertised internships.You could also consider getting student membership of professional bodies such as the IET as it provides sector updates and access to networks.</p>\n<p><b>Typical employers</b>\nElectronic and electrical engineers are highly employable and can find work in many areas, including the electronics, automotive, IT, gaming, telecoms, manufacturing, power, transport, utilities and construction industries.Many global electronics organisations maintain research and development facilities within the UK and Europe. Engineers based in the UK can be posted overseas to work on projects, so a willingness to travel can be important.</p>\n<p><b>Skills for your CV</b>\nn the course of your degree, you develop subject-specific skills in areas such as designing and testing circuit building blocks, computer programming and computer-aided design. You also develop other transferable skills including:\n<ul><li>the ability to use specialist knowledge creatively and innovatively to solve problems</li><li>pragmatism and practicality to turn a concept into reality</li><li>effective communication (spoken and written)</li><li>good teamworking</li><li>project and time management</li><li>a professional approach and ability to work to an ethical code of conduct.</li></ul></p>\n<p><b>Further study</b>\nYou may choose to pursue further study in a specialist field or in research. Potential courses include an MSc or PhD in areas such as internet engineering, nanotechnology, wireless and optical communications and telecommunications. It is as well important to get certified with electrical professional bodies to fit in the competition</p>\n<p><b>What do electrical engineering graduates do?</b>\nThe top five jobs for electrical and electronic engineering graduates include engineering professions, but also programmers and software development professionals. Interestingly, the most common form of employment for these graduates 15 months after graduation is as programmers and software development professionals (13%), with the same amount working as electrical engineers.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.mku.ac.ke\">Mount Kenya University</a></p>\n",
            "company_logo" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQz8K17E_8oySLU_IWgVqxXoG6VW7jTUOOFCSiM9mg5xw7NnAHZQiY1l4e7bAd1tbDifeI&usqp=CAU"
        },
        {
            "id" : 20,
            "type" : "Diploma|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Nairobi Technical Training Institute",
            "company_url" : "https://www.nairobitti.ac.ke",
            "location" : "Nairobi county",
            "title" : "Environmental science",
            "description" : "<p><b>An environmental science degree equips you with the skills and knowledge for a range of jobs in areas such as conservation, sustainability, and environmental research and education</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Amenity horticulturist</li><li>Environmental consultant</li><li>Environmental education officer</li><li>Sustainability consultant</li><li>Environmental engineer</li><li>Environmental manager</li><li>Recycling officer</li><li>Waste management officer</li><li>Water quality scientist</li><li>Nature conservation officer</li><li>Minerals surveyor</li><li>Commercial horticulturist</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Environmental health practitioner</li><li>Horticultural consultant</li><li>Transport planner</li><li>Toxicologist</li><li>Town planner</li><li>Landscape architect</li><li>Water engineer</li><li>Horticultural therapist</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nTo qualify for admission, the trainee must have passed with a Mean Grade of C-(minus) and above in KCSE and they must have passed in Chemistry, Biology/Physics, Mathematics, and English.</p>\n<p><b>Work Experience</b>\nMany environmental organisations and charities need help from people willing to carry out voluntary work. After gaining some initial experience, you may be able to progress into more specialist paid employment. It's also a good idea to get involved in relevant clubs and societies while you're still at university, take up volunteering roles with conservation organisations, or become active in campaigning groups in your local area.Volunteering gives you experience that is difficult to gain elsewhere and shows your commitment. Some students attend conferences and debates on environmental concerns, subscribe to relevant magazines and journals or go travelling. All these experiences will make you more attractive to an employer.</p>\n<p><b>Typical employers</b>\nenvironmental monitoring organisations,environmental consultancies,nature conservation organisations like NEMA,charitable trusts.There are also opportunities available in the utilities sector with water companies and waste management companies, in planning and surveying, the media, and in environmental education and research.</p>\n<p><b>Skills for your CV</b>\nStudying an environmental science degree provides you with a broad understanding of current environmental issues and challenges on a local, national and global scale. You learn about the impact humans have on the environment and how to manage it.These skills are essential:\n<ul><li>problem-solving and creative thinking skills</li><li>competence in developing arguments from scientific, ethical and philosophical perspectives</li><li>research skills and the ability to gather, analyse and report on complex environmental data</li><li>laboratory skills for analysing environmental data</li><li>written and verbal communication skills, including presentation skills</li><li>flexibility to work in all kinds of environments, developed through working in the field</li><li>numerical and IT skills, developed through the application of statistics and measurement techniques</li><li>planning, time management and project-management skills</li><li>the ability to work as part of a team on projects, as well as independently.</li></ul></p>\n<p><b>Further study</b>\nSome environmental science graduates go on to postgraduate study to specialise in a particular area of interest from their undergraduate degree. Others take further qualifications to enter a particular sector such as environmental health, where an accredited degree, degree apprenticeship or postgraduate qualification in environmental health is a requirement.Some graduates are supported by their employers to undertake further study and gain directly relevant professional qualifications.</p>\n<p><b>What do Environmental science graduates do?</b>\nAn environment professional is the most common job for environmental science graduates in employment in the UK. Conservation professional and laboratory technician were also among the top five jobs held by environmental science graduates when surveyed.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://www.nairobitti.ac.ke\">Nairobi Technical Training Institute</a></p>\n",
            "company_logo" : "https://www.nairobitti.ac.ke/images/NTTI_LOGO_NEW.png"
        },
        {
            "id" : 21,
            "type" : "Diploma|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "Kenya Institute of Mass Communication",
            "company_url" : "https://kimc.ac.ke/",
            "location" : "Nairobi",
            "title" : "Film production",
            "description" : "<p><b>Studying film production provides you with the technical, creative and business skills needed to work in the film and wider creative industries</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Film director</li><li>Lighting technician, broadcasting/film/video</li><li>Runner, broadcasting/film/video</li><li>Sound technician, broadcasting/film/video</li><li>Music producer</li><li>Media researcher</li><li>Film/video editor</li><li>Location manager</li><li>Television/film/video producer</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Broadcast engineer</li><li>Special effects technician</li><li>Television production coordinator</li><li>Television floor manager</li><li>Television camera operator</li><li>Sound engineer</li><li>Photographer</li><li>Broadcast journalist</li><li>VFX artist</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\n Mean Grade C plain, C plain in English, Kiswahili and any other 2 subjects.It has two options; i) Diploma in Film/ Video Programs Production (camera option). ii) Diploma in Film/ Video Programs Production (sound option) </p>\n<p><b>Work Experience</b>\nStarting your career in film production can be challenging as there's strong competition for roles. Work experience is essential for building your CV and portfolio/showreel, as well as increasing your networking opportunities. Working as a runner, supporting production staff on film sets, is a good way to learn about the production process and gain valuable contacts in the industry.Make use of the projects you take on at university to build up a portfolio of work. There may be opportunities for work experience or field trips both in the UK and overseas as part of your degree course. You could also help out at local film festivals.Showcase your work to industry professionals at every opportunity, for example at competitions and festivals. Make the most of all opportunities to network and develop your contacts</p>\n<p><b>Typical employers</b>\nJob opportunities are available with film and television production companies, as well as with online broadcasting companies.There are also opportunities within the broader creatives industries, as well as other sectors. Typical employers include: advertising, PR and other creative companies,charities,corporate business,marketing companies,universities.Opportunities may be advertised on industry websites, company websites, in trade magazines or with recruitment agencies. The professional contacts you make through work experience and study can also be a source of opportunities.Some graduates as well do freelance jobs which are shortterm contracts</p>\n<p><b>Skills for your CV</b>\nStudying film production provides you with a mix of the technical, production, creative and business skills needed to work in the film industry. Film production courses include a mix of practice and theory that allow you to develop knowledge in areas such as: cinematography,directing,editing,producing,screen/script writing,sound.\n<ul><li>team work and collaboration</li><li>project management</li><li>the ability to organise your time, resources and people</li><li>flexibility and willingness to adapt</li><li>communication and interpersonal</li><li>quick thinking and the ability to take direction</li><li>working to a brief, to deadline and within a budget</li><li>reflecting on, and evaluating, yours and others' work</li><li>being proactive and having initiative.</li></ul></p>\n<p><b>Further study</b>\nSome graduates go on to postgraduate study in order to further develop their skills in a particular area of film production. There are a range of Masters courses available allowing you to specialise in subjects such as editing, light engineering, sound engineering, distribution and production.It's also possible to do further training to qualify as a teacher. If you want to work as a lecturer or in research, you'll need to do further study at doctorate level.</p>\n<p><b>What do Film production graduates do?</b>\nThe top jobs held by film production graduates include photographers, audio-visual and broadcasting equipment operators (16%), art officers and producers and directors (16%).</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://kimc.ac.ke/\">Kenya Institute of Mass Communication</a></p>\n",
            "company_logo" : "https://i0.wp.com/jobsbureaukenya.club/wp-content/uploads/2021/08/KIMC-LOGO.png?fit=720%2C324&ssl=1"
        },
        {
            "id" : 22,
            "type" : "Undergraduate|Full Time",
            "url" : "",
            "created_at" : "Fri Oct 09 16:4:30 GMT 2021",
            "company" : "University of Nairobi",
            "company_url" : "https://www.uonbi.ac.ke",
            "location" : "Nairobi",
            "title" : "Nursing",
            "description" : "<p><b>Nursing is a vocational degree that develops your personal skills and professionalism, which are qualities valued by many employers</b></p>\n<p><b> Job options </b>\nJobs directly related to your degree include:\n<ul><li>Health play specialist</li><li>Health visitor</li><li>High intensity therapist</li><li>Learning disability nurse</li><li>Mental health nurse</li><li>Midwife</li><li>Paramedic</li><li>Physician associate</li></ul></p>\n<p>Jobs where your degree would be useful include:\n><ul><li>Counsellor</li><li>Further education teacher</li><li>Health service manager</li><li>Genetic counsellor</li><li>Higher education lecturer</li><li>Medicinal chemist</li><li>Play therapist</li><li>Police officer</li><li>Social worker</li></ul>\nRemember that many employers accept applications from graduates with any degree subject, so don't restrict your thinking to the jobs listed here.</p>\n<p><b>Entry Requirements</b>\nCandidates for admission must obtain the prescribed minimum grades in K.C.S.E. in Biology, Chemistry, Physics, Mathematics and English or Kiswahili, or the following:\nBiological Sciences, Physical Science, Mathematics, English or Kiswahili and one subject from group two of K.C.S.E.\nAlternatively, admission may be granted to outstanding diploma holders from recognised Nursing Colleges. Such candidates must: Hold a diploma with credit or distinction from such Colleges.\nBe supported in their application by a statement from the principal of that college to the effect that their performance in the diploma course was exceptionally good and that their understanding of basic sciences is such that they will be able to benefit from a degree course.\nAny candidates currently employed shall have their application supported by a statement from their employer.</p>\n<p><b>Work Experience</b>\nGetting some related work experience in a clinical environment is strongly recommended if you want to work in the healthcare sector. Work experience gives you the opportunity to make important contacts, as well as increading your knowledge of the industry.Volunteering, internships, part-time jobs and student projects can all help to improve key skills which are looked for by employers.Prepare by finding work as a care worker or healthcare assistant, volunteering in a hospital or with any other work experience that involves caring for others. Visiting hospitals and talking directly to nurses about the role is also helpful.</p>\n<p><b>Typical employers</b>\nvoluntary organisations,private sector clinics and hospitals,local authorities (for work in nursing and residential homes),schools and further and higher education institutions,industry,prisons and the armed forces,private sector organisations, such as leisure cruise companies and private nursing homes.</p>\n<p><b>Skills for your CV</b>\nA degree in nursing gives you a range of professional and technical skills, including the ability to work as part of a multidisciplinary team and to support and advise patients and their families. You also develop the ability to assess, analyse, monitor and evaluate the care you deliver.These include:\nflexibility,adaptability,empathy,organisation and time management,leadership,determination and tenacity,the ability to conduct research,problem-solving and decision-making skills.</p>\n<p><b>Further study</b>\nA variety of post-registration courses are available. Graduate nurses can take Masters degrees in subjects such as advanced clinical practice and medical decision-making, as well as various other specialist subjects. You can also train to become an advanced nurse practitioner.Some of these options will be offered by your employer as part of your post-registration education and practice (PREP) requirement. Some training may be offered through study days. Healthcare is constantly developing, and practising nurses need to keep up with technology, current issues and the changing needs of the population through ongoing training.For more information on further study and to find a course that interests you, see Masters degrees and search postgraduate courses in nursing.</p>\n<p><b>What do Nursing graduates do?</b>\nThe majority of nursing graduates (84%) employed in the UK are working as nurses and a further 10% are midwives. Paramedics, health professionals and nursing auxilaries and assistants are also among the top five jobs held.</p>",
            "how_to_apply" : "<p>Please, visit the university website at<a href=\"https://nursing.uonbi.ac.ke/\">University of Nairobi Kenyatta National Hospital (KNH) Campus</a></p>\n",
            "company_logo" : "https://i0.wp.com/www.school-directory.org/wp-content/uploads/2018/03/UoN-logo.png?ssl=1"
        }

    ]
